cases/_base_template/0.template/porosity
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      porosity;
}

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0.999999;
boundaryField
{
    ".*" { type zeroGradient; }
}
