cases/_base_template/constant/appliedCurrent
inputValue 0.09604;
