cases/_base_template/system/changeDictionaryDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createDictionaryDict;
}

boundary
{

wall5
{
type empty;
}

wall6
{type empty;
}


/*
back
{
type empty;
}
*/
} 
