cases/_base_template/system/controlDict_tutorial_electrochem
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     pemfcPorousCathodeFoam;
startFrom       latestTime;
startTime       latestTime;
stopAt          endTime;
endTime         200;
deltaT          1;
writeControl    timeStep;
writeInterval   1;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression uncompressed;
timeFormat      general;
timePrecision   8;
runTimeModifiable yes;
adjustTimeStep  no;
