cases/_base_template/system/createPatchDict
FoamFile { version 2.0; format ascii; class dictionary; object createPatchDict; }
pointSync false;
patches
(
    { name channelInlet; patchInfo { type patch; } constructFrom set; set channelInletFaces; }
    { name channelOutlet; patchInfo { type patch; } constructFrom set; set channelOutletFaces; }
    { name catalyst; patchInfo { type wall; } constructFrom set; set catalystFaces; }
);
