cases/_base_template/system/fvSchemesSS
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
   //default Euler;
   default steadyState;
//steadyState; //new addition
}

gradSchemes
{
    default         Gauss linear;
    grad(fi)         Gauss linear;
}

divSchemes
{
default         bounded Gauss upwind;//none;
    div(rhoPhi,U)  Gauss limitedLinearV 1;//Gauss upwind;
    div(phi,alpha)  Gauss vanLeer;
    div(phirb,alpha) Gauss interfaceCompression; //Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
//additional schemes for simplefoam
div(phi,U)      bounded Gauss linearUpwind limited;
 turbulence      bounded Gauss limitedLinear 1;
    div(phi,k)      $turbulence;
    div(phi,epsilon) $turbulence;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
//div(phi,T)  Gauss vanLeer;
    div(phi,T)      Gauss linearUpwind grad(T);
    //electro
     div(phi,fi) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
    laplacian(DC,C) Gauss linear corrected;
laplacian(DT,T) Gauss linear corrected;
laplacian(k_e,fi) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
