cases/_base_template/system/setFieldsDict
FoamFile { version 2.0; format ascii; class dictionary; object setFieldsDict; }

defaultFieldValues ( volScalarFieldValue porosity 0.999999 );
regions
(
    boxToCell
    {
        type box;
        box (-0.00379 -0.00399 0) (0.00379 0.00399 0.00028);
        fieldValues ( volScalarFieldValue porosity 0.78 );
    }
);
